MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX1025SG60100/mcu.h
#define SW0_SIZE                       _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UINT32_(0x00000200)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UINT32_(       512)
#define USER_PAGE_NB_OF_PAGES          _UINT32_(         1)

#define CMCC_SIZE                      _UINT32_(0x01000000)    /* 16384kB Memory segment type: io */
#define CMCC_DATARAM_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define CMCC_TAGRAM_SIZE               _UINT32_(0x00000400)    /*    1kB Memory segment type: io */
#define CMCC_VALIDRAM_SIZE             _UINT32_(0x00000040)    /*    0kB Memory segment type: io */
#define QSPI_SIZE                      _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define HSRAM_SIZE                     _UINT32_(0x00040000)    /*  256kB Memory segment type: ram */
#define HSRAM_ETB_SIZE                 _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define HSRAM_RET1_SIZE                _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define HPB0_SIZE                      _UINT32_(0x00004400)    /*   17kB Memory segment type: io */
#define HPB1_SIZE                      _UINT32_(0x00022000)    /*  136kB Memory segment type: io */
#define HPB2_SIZE                      _UINT32_(0x00003c00)    /*   15kB Memory segment type: io */
#define HPB3_SIZE                      _UINT32_(0x00003000)    /*   12kB Memory segment type: io */
#define SEEPROM_SIZE                   _UINT32_(0x00020000)    /*  128kB Memory segment type: io */
#define SDHC0_SIZE                     _UINT32_(0x00000c00)    /*    3kB Memory segment type: io */
#define SDHC1_SIZE                     _UINT32_(0x00000c00)    /*    3kB Memory segment type: io */
#define BKUPRAM_SIZE                   _UINT32_(0x00002000)    /*    8kB Memory segment type: ram */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */

#define FLASH_ADDR                     _UINT32_(0x00000000)    /* FLASH base address (type: flash)*/
#define SW0_ADDR                       _UINT32_(0x00800080)    /* SW0 base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UINT32_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define CMCC_ADDR                      _UINT32_(0x03000000)    /* CMCC base address (type: io)*/
#define CMCC_DATARAM_ADDR              _UINT32_(0x03000000)    /* CMCC_DATARAM base address (type: io)*/
#define CMCC_TAGRAM_ADDR               _UINT32_(0x03001000)    /* CMCC_TAGRAM base address (type: io)*/
#define CMCC_VALIDRAM_ADDR             _UINT32_(0x03002000)    /* CMCC_VALIDRAM base address (type: io)*/
#define QSPI_ADDR                      _UINT32_(0x04000000)    /* QSPI base address (type: other)*/
#define HSRAM_ADDR                     _UINT32_(0x20000000)    /* HSRAM base address (type: ram)*/
#define HSRAM_ETB_ADDR                 _UINT32_(0x20000000)    /* HSRAM_ETB base address (type: ram)*/
#define HSRAM_RET1_ADDR                _UINT32_(0x20000000)    /* HSRAM_RET1 base address (type: ram)*/
#define HPB0_ADDR                      _UINT32_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UINT32_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UINT32_(0x42000000)    /* HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UINT32_(0x43000000)    /* HPB3 base address (type: io)*/
#define SEEPROM_ADDR                   _UINT32_(0x44000000)    /* SEEPROM base address (type: io)*/
#define SDHC0_ADDR                     _UINT32_(0x45000000)    /* SDHC0 base address (type: io)*/
#define SDHC1_ADDR                     _UINT32_(0x46000000)    /* SDHC1 base address (type: io)*/
#define BKUPRAM_ADDR                   _UINT32_(0x47000000)    /* BKUPRAM base address (type: ram)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/
#define SCS_ADDR                       _UINT32_(0xe000e000)    /* SCS base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CX1025SG60100                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X61800501)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CX1025SG60100                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CX1025SG60100 */
/* ************************************************************************** */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL_0                  1 /* ID for OSCCTRL event generator XOSC_FAIL_0 */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL_1                  2 /* ID for OSCCTRL event generator XOSC_FAIL_1 */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              3 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_RTC_PER_0                            4 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                           12 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           13 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_CMP_2                           14 /* ID for RTC event generator CMP_2 */
#define EVENT_ID_GEN_RTC_CMP_3                           15 /* ID for RTC event generator CMP_3 */
#define EVENT_ID_GEN_RTC_TAMPER                          16 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             17 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_EIC_EXTINT_0                        18 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        19 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        20 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        21 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        22 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        23 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        24 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        25 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        26 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        27 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       28 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       29 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       30 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       31 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       32 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       33 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           34 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           35 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           36 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           37 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          38 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_TCC0_OVF                            41 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            42 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            43 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           44 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           45 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           46 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           47 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC0_MC_4                           48 /* ID for TCC0 event generator MC_4 */
#define EVENT_ID_GEN_TCC0_MC_5                           49 /* ID for TCC0 event generator MC_5 */
#define EVENT_ID_GEN_TCC1_OVF                            50 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            51 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            52 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           53 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           54 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC1_MC_2                           55 /* ID for TCC1 event generator MC_2 */
#define EVENT_ID_GEN_TCC1_MC_3                           56 /* ID for TCC1 event generator MC_3 */
#define EVENT_ID_GEN_TCC2_OVF                            57 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            58 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            59 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           60 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           61 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_MC_2                           62 /* ID for TCC2 event generator MC_2 */
#define EVENT_ID_GEN_TCC3_OVF                            63 /* ID for TCC3 event generator OVF */
#define EVENT_ID_GEN_TCC3_TRG                            64 /* ID for TCC3 event generator TRG */
#define EVENT_ID_GEN_TCC3_CNT                            65 /* ID for TCC3 event generator CNT */
#define EVENT_ID_GEN_TCC3_MC_0                           66 /* ID for TCC3 event generator MC_0 */
#define EVENT_ID_GEN_TCC3_MC_1                           67 /* ID for TCC3 event generator MC_1 */
#define EVENT_ID_GEN_TCC4_OVF                            68 /* ID for TCC4 event generator OVF */
#define EVENT_ID_GEN_TCC4_TRG                            69 /* ID for TCC4 event generator TRG */
#define EVENT_ID_GEN_TCC4_CNT                            70 /* ID for TCC4 event generator CNT */
#define EVENT_ID_GEN_TCC4_MC_0                           71 /* ID for TCC4 event generator MC_0 */
#define EVENT_ID_GEN_TCC4_MC_1                           72 /* ID for TCC4 event generator MC_1 */
#define EVENT_ID_GEN_TC0_OVF                             73 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            74 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            75 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             76 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            77 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            78 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             79 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            80 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            81 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             82 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            83 /* ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            84 /* ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             85 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            86 /* ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            87 /* ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_TC5_OVF                             88 /* ID for TC5 event generator OVF */
#define EVENT_ID_GEN_TC5_MC_0                            89 /* ID for TC5 event generator MC_0 */
#define EVENT_ID_GEN_TC5_MC_1                            90 /* ID for TC5 event generator MC_1 */
#define EVENT_ID_GEN_TC6_OVF                             91 /* ID for TC6 event generator OVF */
#define EVENT_ID_GEN_TC6_MC_0                            92 /* ID for TC6 event generator MC_0 */
#define EVENT_ID_GEN_TC6_MC_1                            93 /* ID for TC6 event generator MC_1 */
#define EVENT_ID_GEN_TC7_OVF                             94 /* ID for TC7 event generator OVF */
#define EVENT_ID_GEN_TC7_MC_0                            95 /* ID for TC7 event generator MC_0 */
#define EVENT_ID_GEN_TC7_MC_1                            96 /* ID for TC7 event generator MC_1 */
#define EVENT_ID_GEN_PDEC_OVF                            97 /* ID for PDEC event generator OVF */
#define EVENT_ID_GEN_PDEC_ERR                            98 /* ID for PDEC event generator ERR */
#define EVENT_ID_GEN_PDEC_DIR                            99 /* ID for PDEC event generator DIR */
#define EVENT_ID_GEN_PDEC_VLC                           100 /* ID for PDEC event generator VLC */
#define EVENT_ID_GEN_PDEC_MC_0                          101 /* ID for PDEC event generator MC_0 */
#define EVENT_ID_GEN_PDEC_MC_1                          102 /* ID for PDEC event generator MC_1 */
#define EVENT_ID_GEN_ADC0_RESRDY                        103 /* ID for ADC0 event generator RESRDY */
#define EVENT_ID_GEN_ADC0_WINMON                        104 /* ID for ADC0 event generator WINMON */
#define EVENT_ID_GEN_ADC1_RESRDY                        105 /* ID for ADC1 event generator RESRDY */
#define EVENT_ID_GEN_ADC1_WINMON                        106 /* ID for ADC1 event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                          107 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                          108 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                           109 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY_0                        110 /* ID for DAC event generator EMPTY_0 */
#define EVENT_ID_GEN_DAC_EMPTY_1                        111 /* ID for DAC event generator EMPTY_1 */
#define EVENT_ID_GEN_GMAC_TSU_CMP                       114 /* ID for GMAC event generator TSU_CMP */
#define EVENT_ID_GEN_TRNG_READY                         115 /* ID for TRNG event generator READY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                       116 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                       117 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                       118 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                       119 /* ID for CCL event generator LUTOUT_3 */

/* ************************************************************************** */
/*  Event User IDs for C32CX1025SG60100 */
/* ************************************************************************** */
#define EVENT_ID_USER_RTC_TAMPER                          0 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_PORT_EV_0                           1 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           2 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           3 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           4 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           5 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           6 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           7 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           8 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                           9 /* ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                          10 /* ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                          11 /* ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                          12 /* ID for DMAC event user CH_7 */
#define EVENT_ID_USER_CM4_TRACE_START                    14 /* ID for CM4 event user TRACE_START */
#define EVENT_ID_USER_CM4_TRACE_STOP                     15 /* ID for CM4 event user TRACE_STOP */
#define EVENT_ID_USER_CM4_TRACE_TRIG                     16 /* ID for CM4 event user TRACE_TRIG */
#define EVENT_ID_USER_TCC0_EV_0                          17 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          18 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          19 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          20 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          21 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          22 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC0_MC_4                          23 /* ID for TCC0 event user MC_4 */
#define EVENT_ID_USER_TCC0_MC_5                          24 /* ID for TCC0 event user MC_5 */
#define EVENT_ID_USER_TCC1_EV_0                          25 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          26 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          27 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          28 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC1_MC_2                          29 /* ID for TCC1 event user MC_2 */
#define EVENT_ID_USER_TCC1_MC_3                          30 /* ID for TCC1 event user MC_3 */
#define EVENT_ID_USER_TCC2_EV_0                          31 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          32 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          33 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          34 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TCC2_MC_2                          35 /* ID for TCC2 event user MC_2 */
#define EVENT_ID_USER_TCC3_EV_0                          36 /* ID for TCC3 event user EV_0 */
#define EVENT_ID_USER_TCC3_EV_1                          37 /* ID for TCC3 event user EV_1 */
#define EVENT_ID_USER_TCC3_MC_0                          38 /* ID for TCC3 event user MC_0 */
#define EVENT_ID_USER_TCC3_MC_1                          39 /* ID for TCC3 event user MC_1 */
#define EVENT_ID_USER_TCC4_EV_0                          40 /* ID for TCC4 event user EV_0 */
#define EVENT_ID_USER_TCC4_EV_1                          41 /* ID for TCC4 event user EV_1 */
#define EVENT_ID_USER_TCC4_MC_0                          42 /* ID for TCC4 event user MC_0 */
#define EVENT_ID_USER_TCC4_MC_1                          43 /* ID for TCC4 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            44 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            45 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            46 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            47 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            48 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_TC5_EVU                            49 /* ID for TC5 event user EVU */
#define EVENT_ID_USER_TC6_EVU                            50 /* ID for TC6 event user EVU */
#define EVENT_ID_USER_TC7_EVU                            51 /* ID for TC7 event user EVU */
#define EVENT_ID_USER_PDEC_EVU_0                         52 /* ID for PDEC event user EVU_0 */
#define EVENT_ID_USER_PDEC_EVU_1                         53 /* ID for PDEC event user EVU_1 */
#define EVENT_ID_USER_PDEC_EVU_2                         54 /* ID for PDEC event user EVU_2 */
#define EVENT_ID_USER_ADC0_START                         55 /* ID for ADC0 event user START */
#define EVENT_ID_USER_ADC0_SYNC                          56 /* ID for ADC0 event user SYNC */
#define EVENT_ID_USER_ADC1_START                         57 /* ID for ADC1 event user START */
#define EVENT_ID_USER_ADC1_SYNC                          58 /* ID for ADC1 event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           59 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           60 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START_0                        61 /* ID for DAC event user START_0 */
#define EVENT_ID_USER_DAC_START_1                        62 /* ID for DAC event user START_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        63 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        64 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        65 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        66 /* ID for CCL event user LUTIN_3 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CX1025SG60100_H_ */

